Repository: pinkcode27/tutoring_website
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: es

source: Full Name
es: Nombre Completo

source: Email
es: Correo Electrónico

source: What are you after?
es: ¿En qué te puedo ayudar?

source: Please choose one option:
es: Por favor, elija una opción:

source: I have a general inquiry
es: Tengo una pregunta general

source: tutoring
es: tutoría

source: I need tutoring
es: Necesito tutoría

source: english
es: inglés

source: I need English classes
es: Necesito clases de inglés

source: pyhton
es: python

source: I need Python classes
es: Necesito clases de Python

source: web-dev
es: Desarrollo de páginas web

source: I need Web Dev classes
es: Necesito clases de web-dev

source: I need MS Excel classes
es: Necesito clases de Excel

source: other
es: otro

source: Other
es: Otro

source: Message
es: Mensaje

source: Send Message
es: Enviar mensaje

source: Your message has been sent successfully!
es: Tu mensaje ha sido enviado!

source: An error occurred while sending the email. Please try again later.
es: Un error ocurrió tratando de enviar el mensaje. Intenta mas tarde por favor.

source: Unlock Academic Success: Our website offers expert tutoring, homework coaching, and courses in English and Spanish for K4-K12 students. Learn Python, web development, and MS Excel for beginners.
es: Descubre el éxito académico: nuestro sitio web ofrece tutoría experta, asesoramiento en tareas y cursos en inglés para estudiantes de primaria a secundaria. Aprende Python, desarrollo web y MS Excel para principiantes.

source: Today's Tutoring
es: Tutorías

source: by Elena Murga. All rights reserved. Illustrations by
es: por Elena Murga. Todos los derechos reservados. Ilustraciones por

source: Home
es: Inicio

source: About
es: Sobre Mí

source: Services
es: Servicios

source: Contact
es: Contacto

source: Elevate Your Learning With Expert Tutoring.
es: Eleva tu aprendizaje con tutores expertos.

source: With over a decade of experience in education, our tutoring service company has a proven track record of helping students achieve academic excellence. We empower students on their journey to success, setting a gold standard in educational achievement.
es: Con más de una década de experiencia en educación, nuestra empresa de servicios de tutoría tiene un historial comprobado de ayudar a los estudiantes a alcanzar la excelencia académica. Empoderamos a los estudiantes en su camino hacia el éxito, estableciendo un estándar de oro en logros educativos.

source: Get Started
es: Empieza hoy

source: The learner explorer
es: El aprendíz explorador

source: About Me
es: Sobre Mí

source: Welcome to my tutoring and coaching services! I'm Elena, a dedicated tutor with over a decade of experience in math, English, MS Excel, Python, and web development. I hold a Bachelor's in Information Technology and Industrial Engineering, and an Associate's in Math Education. I'm fluent in English and Spanish, and all sessions are bilingual.
es: ¡Bienvenido a mis servicios de tutoría y coaching! Soy Elena, una tutora dedicada con más de una década de experiencia en matemáticas, inglés, MS Excel, Python y desarrollo web. Tengo una Ingeniería en Tecnología de la Información y otra en Ingeniería Industrial y un Asociado en Educación Secundaria de Matemáticas. Hablo inglés y español con fluidez y todas las sesiones son bilingües.

source: I'm here to support all students on their academic journey, regardless of their background. Whether you need help with homework, want to learn a new programming language, or aim to improve your English skills. I've had the privilege of working with students from all levels of ability, including students from prestigious South Florida private schools like Ransom Everglades and Miami Country Day. I'm confident that together, we can achieve your goals. Don't hesitate to reach out and start your learning journey with me today!
es: Estoy aquí para apoyar a todos los estudiantes en su trayectoria académica , independientemente de sus antecedentes. Ya sea que necesite ayuda con la tarea, desee aprender un nuevo lenguaje de programación o desee mejorar sus habilidades en inglés. He tenido el privilegio de trabajar con estudiantes de todos los niveles, incluidos estudiantes de prestigiosas escuelas privadas del sur de Florida como Ransom Everglades y Miami Country Day. Estoy segura de que juntos podremos lograr tus objetivos. ¡No dudes en comunicarte y comenzar tu viaje de aprendizaje conmigo hoy!

source: Go to my LinkedIn
es: Visita mi LinkedIn

source: I'm here to support you with homework, from K4 - K12 grade, across diverse subjects.
es: Estoy aquí para ayudarte con tú tarea, de primaria a secundaria, de cualquier materia.

source: Math Tutoring
es: Tutorías de matemáticas

source: Expert guidance for mastering mathematical concepts and problem-solving skills.
es: Guía experta para dominar conceptos de matemáticas y habilidades de resolución de problemas.

source: English Course
es: Curso de Inglés

source: Suitable for individuals of all ages, catering to both social and professional communication needs.
es: Adecuado para personas de todas las edades, para tus necesidades de comunicación sociales y/o profesionales.

source: MS Excel Course
es: Curso de MS Excel

source: A beginner-friendly MS Excel course providing essential skills for effective spreadsheet use.
es: Un curso de MS Excel para principiantes que proporciona habilidades esenciales para el uso eficaz de hojas de cálculo.

source: Python for Beginners
es: Python para Principiantes

source: Introduction to programming with Python, ideal for those new to coding.
es: Introducción a la programación con Python, ideal para quienes son nuevos programando.

source: WebDev Course
es: Desarrollo Páginas Web

source: Entry-level course to kickstart web development skills and create basic websites.
es: Curso de nivel básico para impulsar las habilidades de desarrollo web y crear sitios web básicos.

source: Schedule
es: Horarios

source: We operate every day of the year, from
es: Operamos todos los días del año, de

source: Languages
es: Idiomas

source: We are fluent in <span>English and Spanish</span>, offering bilingual classes for seamless communication.
es: Clases bilingües en inglés y español.

source: How can I help?
es: ¿Cómo te puedo ayudar?

source: Hi there, I'm interested in...
es: Hola, estoy interesado en...

source: File Not Found
es: Archivo No Encontrado

source: An unexpected error has occurred
es: Ocurrió un error inesperado

source: The administration has been notified. Sorry for the inconvenience!
es: La administración ha sido notificada. ¡Perdón por los inconvenientes ocasionados!
